{
  "personal": {
    "name": "Timothy Kipchirchir Kanda",
    "title": "Graduate Software Developer",
    "location": "Sydney, NSW, Australia",
    "email": "tmthkanda@gmail.com",
    "phone": "+61 435 426 947",
    "github": "https://github.com/timkanda",
    "linkedin": "https://www.linkedin.com/in/timothy-kanda-aaa190b4"
  },
  "content_chunks": [
    {
      "id": "intro",
      "title": "Who is Timothy Kanda",
      "type": "personal",
      "content": "Timothy Kanda is a Graduate Software Developer in Sydney, Australia. Master of IT (Software Development) from Swinburne University, September 2025. Seeking Graduate Developer, Junior Full-Stack, or Backend Developer roles.",
      "metadata": { "tags": ["personal", "intro"] }
    },
    {
      "id": "strengths",
      "title": "Key Strengths",
      "type": "strengths",
      "content": "Key Strengths: Problem-solving, System design thinking, Data quality awareness, Clear communication, Trade-off judgment, Scalability decisions.",
      "metadata": { "tags": ["strengths", "skills"] }
    },
    {
      "id": "edu-masters",
      "title": "Masters Degree Details",
      "type": "education",
      "content": "Master of Information Technology (Software Development), Swinburne University of Technology, Sydney. Completed September 2025. Key subjects: Software Engineering Principles, Database Systems, Cloud Computing, Agile Methodologies, Web Development, Data Structures & Algorithms, IT Project Management.",
      "metadata": { "tags": ["education", "university", "masters"] }
    },
    {
      "id": "edu-courses",
      "title": "University Coursework Details",
      "type": "education",
      "content": "University Courses Completed: (1) Software Engineering - SDLC, design patterns, testing strategies, code quality. (2) Database Systems - SQL, normalization, query optimization, PostgreSQL. (3) Cloud Computing - AWS services, deployment, scalability. (4) Web Development - HTML5, CSS3, JavaScript, React fundamentals. (5) Agile Methodologies - Scrum, sprints, user stories, retrospectives. (6) Data Structures & Algorithms - Arrays, trees, graphs, sorting, Big-O analysis. (7) IT Project Management - Planning, risk management, stakeholder communication.",
      "metadata": { "tags": ["education", "courses", "subjects"] }
    },
    {
      "id": "exp-ausbiz",
      "title": "AusBiz Internship Experience",
      "type": "experience",
      "content": "Full Stack Developer Intern at Employability Advantage × AusBiz Consulting (April-July 2025). Tech stack: Next.js, TypeScript, Prisma, PostgreSQL, NextAuth.js, AWS. Built AI Participation Management System. Used React for dashboards, Node.js for APIs, PostgreSQL for data storage, AWS for deployment.",
      "metadata": { "tags": ["experience", "internship", "ausbiz"] }
    },
    {
      "id": "exp-ausbiz-star-1",
      "title": "STAR Example: Problem Solving at AusBiz",
      "type": "experience",
      "content": "STAR Example - Problem Solving: SITUATION: Student allocation system had manual CSV matching taking 20+ hours/week with 40% error rate. TASK: Design automated matching system with accuracy validation. ACTION: Built deterministic matching for exact student IDs, fuzzy matching (Levenshtein distance) for name variations, human-in-the-loop confirmation for edge cases. Used TypeScript, Prisma ORM, PostgreSQL. RESULT: Reduced manual work by 20 hours/week, achieved 90% automation rate, improved accuracy to 99%.",
      "metadata": { "tags": ["experience", "star", "problem-solving"] }
    },
    {
      "id": "exp-ausbiz-star-2",
      "title": "STAR Example: System Design at AusBiz",
      "type": "experience",
      "content": "STAR Example - System Design: SITUATION: Compliance reporting required audit trail for all allocation decisions. TASK: Design system that maintains data integrity for auditors. ACTION: Implemented append-only event sourcing pattern, created immutable audit logs with timestamps and user IDs, built compliance dashboard with filtering and export. Used PostgreSQL triggers and Next.js API routes. RESULT: Passed compliance review, 99.9% uptime, audit-safe workflow approved by stakeholders.",
      "metadata": { "tags": ["experience", "star", "system-design"] }
    },
    {
      "id": "exp-kenyan",
      "title": "Kenyan Diaspora Media Experience",
      "type": "experience",
      "content": "Website Manager & Web Developer at The Kenyan Diaspora Media (March 2022-Present). Tech stack: WordPress, PHP, MySQL, HTML5, CSS3, JavaScript. Built custom plugins for content management. Maintained production site serving diaspora community.",
      "metadata": { "tags": ["experience", "wordpress", "php"] }
    },
    {
      "id": "exp-kenyan-star",
      "title": "STAR Example: WordPress Challenge",
      "type": "experience",
      "content": "STAR Example - WordPress: SITUATION: Non-technical editors struggled with complex WordPress admin, causing content delays. TASK: Simplify content workflow for editors without coding knowledge. ACTION: Developed custom WordPress plugin with simplified dashboard, drag-drop content blocks, and preview functionality. Used PHP hooks, JavaScript, custom post types. RESULT: Reduced content publishing time by 50%, zero training required for new editors, increased publishing frequency by 3x.",
      "metadata": { "tags": ["experience", "star", "wordpress"] }
    },
    {
      "id": "exp-kipdev",
      "title": "Kipdev Internship Experience",
      "type": "experience",
      "content": "Web Developer Intern at Kipdev WP Solutions (March-October 2022). Tech stack: WordPress, PHP, MySQL, HTML5, CSS3. Built user registration/authentication systems. Worked on full web development lifecycle from requirements to deployment.",
      "metadata": { "tags": ["experience", "internship", "wordpress"] }
    },
    {
      "id": "project-ai-participation",
      "title": "AI Participation Management System",
      "type": "project",
      "content": "Project: AI Participation Management System. Tech: Next.js, TypeScript, Prisma, PostgreSQL, NextAuth.js, AWS, OpenAI API. Features: CSV enrollment import, deterministic/fuzzy matching, human-in-the-loop confirmation, compliance dashboards, audit-safe workflows. Impact: 20 hours/week saved, 90% admin automation, 85% allocation satisfaction, 99.9% uptime.",
      "metadata": { "tags": ["project", "ai", "enterprise"] }
    },
    {
      "id": "project-digital-twin",
      "title": "Digital Twin Portfolio Project",
      "type": "project",
      "content": "Project: AI Digital Twin Portfolio. Tech: Next.js, TypeScript, Upstash Vector, Groq LLaMA, MCP Protocol. Features: RAG-based semantic search, vector embeddings for professional data, MCP server for Claude Desktop integration. Demonstrates: AI integration, modern web architecture, production deployment.",
      "metadata": { "tags": ["project", "ai", "rag", "mcp"] }
    },
    {
      "id": "skills-used-nextjs",
      "title": "Next.js Experience",
      "type": "skills",
      "content": "Next.js Experience: Used in AI Participation Management System (AusBiz internship) and Digital Twin Portfolio. App Router, SSR, API routes, server actions. 6 months production experience.",
      "metadata": { "tags": ["skills", "nextjs", "react"] }
    },
    {
      "id": "skills-used-typescript",
      "title": "TypeScript Experience",
      "type": "skills",
      "content": "TypeScript Experience: Used in all projects at AusBiz internship. Strict type safety, interfaces for API contracts, Prisma type generation. 6 months production experience.",
      "metadata": { "tags": ["skills", "typescript"] }
    },
    {
      "id": "skills-used-postgresql",
      "title": "PostgreSQL Experience",
      "type": "skills",
      "content": "PostgreSQL Experience: Used in AI Participation Management System. Schema design, Prisma ORM integration, migrations, query optimization. Learned in Database Systems course at university.",
      "metadata": { "tags": ["skills", "postgresql", "database"] }
    },
    {
      "id": "skills-used-aws",
      "title": "AWS Experience",
      "type": "skills",
      "content": "AWS Experience: Used EC2, S3, RDS, Amplify for deployment at AusBiz. CI/CD pipelines, cloud infrastructure. Learned in Cloud Computing course at university and AWS Bootcamp.",
      "metadata": { "tags": ["skills", "aws", "cloud"] }
    },
    {
      "id": "skills-used-wordpress",
      "title": "WordPress Experience",
      "type": "skills",
      "content": "WordPress Experience: 3+ years at Kenyan Diaspora Media and Kipdev. Custom plugin development, PHP hooks, theme customization, MySQL database management. Built user authentication systems and CMS workflows.",
      "metadata": { "tags": ["skills", "wordpress", "php"] }
    },
    {
      "id": "skills-used-html5",
      "title": "HTML5 Experience",
      "type": "skills",
      "content": "HTML5 Experience: Used across all web projects since 2022. Semantic markup, accessibility, responsive design. Applied in WordPress themes, React components, and static sites. Learned in Web Development course and eMobilis bootcamp.",
      "metadata": { "tags": ["skills", "html5", "frontend"] }
    },
    {
      "id": "skills-used-react",
      "title": "React Experience",
      "type": "skills",
      "content": "React Experience: Used in AI Participation Management System and Digital Twin. Functional components, hooks (useState, useEffect, useContext), component libraries (shadcn/ui). 6 months production experience.",
      "metadata": { "tags": ["skills", "react", "frontend"] }
    },
    {
      "id": "certifications",
      "title": "Certifications and Training",
      "type": "certification",
      "content": "Certifications: (1) 10-Week Full Stack Developer Internship - Employability Advantage × AusBiz Consulting, 2025. (2) Full-Stack with AWS Cloud Bootcamp - AusBiz Consulting, 2024. (3) Web Development Program - eMobilis Institute (Mastercard Foundation Scholarship), 2022.",
      "metadata": { "tags": ["certification", "training"] }
    },
    {
      "id": "facts-contact",
      "title": "Contact Information",
      "type": "facts",
      "content": "Contact: Email tmthkanda@gmail.com, Phone +61 435 426 947, GitHub github.com/timkanda, LinkedIn linkedin.com/in/timothy-kanda-aaa190b4. Location: Sydney, NSW, Australia. Work authorization: Australian Work Rights.",
      "metadata": { "tags": ["contact", "facts"] }
    },
    {
      "id": "facts-numbers",
      "title": "Key Metrics and Numbers",
      "type": "facts",
      "content": "Key Metrics: 20 hours/week manual work reduction, 90% admin task automation, 85% allocation satisfaction improvement, 99.9% system uptime, 3+ years WordPress experience, 6 months Next.js production experience, Master's degree completed September 2025.",
      "metadata": { "tags": ["metrics", "facts", "numbers"] }
    },
    {
      "id": "interview-why-hire",
      "title": "Why Hire Timothy",
      "type": "interview",
      "content": "Why hire Timothy: Combines Master's degree education with production experience. Delivered 20 hours/week efficiency gain at internship. Modern tech stack (Next.js, TypeScript, PostgreSQL, AWS). AI integration experience. Quick learner, clear communicator.",
      "metadata": { "tags": ["interview", "hire"] }
    },
    {
      "id": "star-teamwork",
      "title": "STAR Example: Teamwork and Collaboration",
      "type": "experience",
      "content": "STAR Example - Teamwork: SITUATION: During AusBiz internship, worked with 5 interns and 3 industry mentors on AI Participation System. Different skill levels and time zones created coordination challenges. TASK: Ensure smooth collaboration and consistent code quality across team. ACTION: Set up daily standups, created shared coding standards document, implemented PR review process, used GitHub Projects for task tracking, pair-programmed with junior members. RESULT: Team delivered project 1 week ahead of schedule, all members passed code review standards, 100% of assigned features completed.",
      "metadata": { "tags": ["experience", "star", "teamwork", "collaboration"] }
    },
    {
      "id": "star-learning",
      "title": "STAR Example: Learning New Technology Quickly",
      "type": "experience",
      "content": "STAR Example - Learning Agility: SITUATION: AusBiz project required Prisma ORM which I had never used before. Deadline was 2 weeks away. TASK: Learn Prisma ORM and implement database layer for AI matching system. ACTION: Completed Prisma documentation in 3 days, built practice project, then implemented production schema with 15 tables and complex relations. Asked mentors for code review, iterated based on feedback. RESULT: Fully functional database layer in 10 days, schema passed architecture review, reusable patterns adopted by other team members.",
      "metadata": { "tags": ["experience", "star", "learning", "adaptability"] }
    },
    {
      "id": "star-deadline",
      "title": "STAR Example: Meeting Tight Deadlines",
      "type": "experience",
      "content": "STAR Example - Deadline Pressure: SITUATION: Client demo scheduled in 3 days, but CSV import feature had critical bug causing data corruption. TASK: Fix bug and ensure data integrity before demo. ACTION: Debugged systematically using logging and test data, identified race condition in async processing, implemented transaction-based import with rollback on failure, added validation layer. Worked extended hours, kept team updated on progress. RESULT: Bug fixed in 2 days, demo successful, client approved next phase, no data corruption incidents after fix.",
      "metadata": { "tags": ["experience", "star", "deadline", "pressure"] }
    },
    {
      "id": "star-conflict",
      "title": "STAR Example: Handling Disagreement",
      "type": "experience",
      "content": "STAR Example - Conflict Resolution: SITUATION: Team disagreed on authentication approach - some wanted NextAuth.js, others preferred custom JWT solution. TASK: Reach consensus and implement secure authentication. ACTION: Facilitated discussion, listed pros/cons of each approach, researched security implications, proposed NextAuth.js for faster development with option to customize later. Documented decision rationale for future reference. RESULT: Team agreed on NextAuth.js, implemented in 4 days, authentication passed security review, decision document became team best practice.",
      "metadata": { "tags": ["experience", "star", "conflict", "communication"] }
    },
    {
      "id": "star-feedback",
      "title": "STAR Example: Receiving and Acting on Feedback",
      "type": "experience",
      "content": "STAR Example - Feedback: SITUATION: Code review feedback indicated my API routes were not following REST conventions and lacked proper error handling. TASK: Improve code quality and learn best practices. ACTION: Studied REST API design patterns, refactored all 12 API routes with proper HTTP status codes, consistent response formats, and comprehensive error handling. Asked for follow-up review, documented patterns for team. RESULT: Subsequent code reviews had 80% fewer comments, API patterns adopted as team standard, mentor recommended me for backend-focused tasks.",
      "metadata": { "tags": ["experience", "star", "feedback", "growth"] }
    },
    {
      "id": "star-initiative",
      "title": "STAR Example: Taking Initiative",
      "type": "experience",
      "content": "STAR Example - Initiative: SITUATION: Noticed manual testing was taking 2+ hours per deployment, slowing team velocity. TASK: Improve testing efficiency without disrupting current workflow. ACTION: Proposed automated testing to mentor, received approval, set up Jest and React Testing Library, wrote 45 unit tests for critical components, integrated with GitHub Actions CI/CD. Trained team on writing tests. RESULT: Testing time reduced from 2 hours to 15 minutes, caught 3 bugs before production, team adopted testing culture.",
      "metadata": { "tags": ["experience", "star", "initiative", "automation"] }
    },
    {
      "id": "star-failure",
      "title": "STAR Example: Learning from Failure",
      "type": "experience",
      "content": "STAR Example - Failure Recovery: SITUATION: Deployed database migration that accidentally deleted test data in staging environment. Team lost 2 days of test scenarios. TASK: Recover data and prevent future incidents. ACTION: Immediately notified team and mentor, restored from backup (partial recovery), manually recreated lost test data, implemented migration checklist with backup verification, added staging environment protection. RESULT: Full recovery within 24 hours, new migration process prevented similar incidents, became team's migration safety advocate.",
      "metadata": { "tags": ["experience", "star", "failure", "learning"] }
    },
    {
      "id": "star-ai-integration",
      "title": "STAR Example: AI Integration Challenge",
      "type": "experience",
      "content": "STAR Example - AI Integration: SITUATION: AI matching algorithm needed to handle 500+ student allocations with 95% accuracy requirement. OpenAI API latency was causing timeouts. TASK: Optimize AI integration for production scale and reliability. ACTION: Implemented batch processing with queue system, added caching for repeated queries, created fallback to deterministic matching when AI unavailable, added retry logic with exponential backoff. Used AWS SQS for queue management. RESULT: Achieved 98% accuracy, handled 1000+ allocations in production, zero timeouts after optimization, 99.9% uptime.",
      "metadata": { "tags": ["experience", "star", "ai", "optimization"] }
    },
    {
      "id": "interview-star-knowledge",
      "title": "STAR Interview Method Knowledge",
      "type": "interview",
      "content": "I use the STAR interview method to structure behavioral answers: SITUATION (context and background), TASK (my specific responsibility), ACTION (steps I took with detail on HOW), RESULT (quantifiable outcomes and learnings). This framework ensures my answers are specific, demonstrate my contributions, and show measurable impact. I prepare STAR examples for common themes: problem-solving, teamwork, learning, deadlines, conflicts, feedback, initiative, and failures.",
      "metadata": { "tags": ["interview", "star", "method"] }
    },
    {
      "id": "weakness-mitigation",
      "title": "Weakness and Mitigation",
      "type": "interview",
      "content": "Weakness: Limited production experience in large-scale distributed systems. Mitigation: Completed Cloud Computing course covering AWS scalability, studied system design patterns, building Digital Twin project with vector databases and MCP protocol. Actively learning through projects and seeking mentorship. Weakness: No direct DevOps/Kubernetes experience. Mitigation: Completed AWS Bootcamp, set up CI/CD pipelines, planning to pursue AWS certification.",
      "metadata": { "tags": ["interview", "weakness", "growth"] }
    }
  ]
}
